Tekla Open API Reference for Tekla Structures 2025
View.ViewType Property
 The view type information.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.ViewTypes ViewType { get; }
Public ReadOnly Property ViewType As View.ViewTypes
	Get
Property Value
Type: View.ViewTypes
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace